<script setup>
const RentalCalendarItem = resolveComponent('RentalCalendarItem')

// Props
const props = defineProps({
	range: Object,
})

// Mock table data
const data = ref([
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
	{
		stuff: 'Car', // Первый столбец с текстом
		mon: '', // Понедельник
		tue: '', // Вторник
		wed: '', // Среда
		thu: '', // Четверг
		fri: '', // Пятница
		sat: '', // Суббота
		sun: ''  // Воскресенье
	},
])

// Table columns
const columns = computed(()=> useCalendarColumns(props.range?.start, props.range?.end, RentalCalendarItem));

</script>

<template>
	<UTable
		:data="data"
		:columns="columns"
		sticky
		class="flex-1 max-h-[410px] border-collapse"
	/>
</template>